"""
3层神经网络：  
 输入层（第0层）有2个神经元x1,x2  
 第1个隐藏层（第1层）有3个神经元a1,a2,a3  
 第2个隐藏层（第2层）有2个神经元a1,a2 和上面不同  
 输出层（第3层）有2个神经元y1, y2

偏置：b1  
权重：W11, W12 (W11：地一层的第一个神经元的权重，W12：地一层的第二个神经元的权重)  
输入信号：x1, x2

第一层：  
a1 = W11x1 + W12x2 + b1

使用矩阵的乘法运算:  
第一层：  
A1 = XW1 + B1  
A1 = (a1,a2,a3), X = (x1,x2), B1 = (b1,b2,b3),  
W1 =  
(W11 W21 W31  
W12 W22 W32  
)
"""

import numpy as np

#sigmoid函数
def sigmoid(x): # 参数为NumPy数组
  return 1/(1+np.exp(-x))

#---------------第一层隐藏层--------------
X = np.array([1.0, 0.5]) #输入信号：x1, x2
W1 = np.array([[0.1, 0.3, 0.5], [0.2, 0.4, 0.6]])  # 权重,
"""
W1 =  
(W11 W21 W31  
W12 W22 W32  
)
权重：W11：第一层的第一个神经元的权重，W12：第一层的第二个神经元的权重)

"""
B1 = np.array([0.1, 0.2, 0.3])#偏置
print(f"第一层输入形状{X.shape}") # (2,)
print(f"第一层权重形状{W1.shape}") #(2, 3) 
print(f"第一层偏置形状{W1.shape}") # (2, 3)

A1 = np.dot(X, W1) + B1
Z1 = sigmoid(A1) # 使用激活函数
print(f"第一层激活值为{Z1}") # [0.57444252 0.66818777 0.75026011] (3,) 将作为输入信号传入第二层

#---------------第二层隐藏层--------------
W2 = np.array([[0.1, 0.4], [0.2, 0.5], [0.3, 0.6]])# 权重 ，(3,2)
B2 = np.array([0.1, 0.2]) # 偏置 （这里为什么是两个偏置？因为两个矩阵乘积的形状：(3,)(3,2)=(2,)）
print(f"第二层输入形状{Z1.shape}") # (3,)
print(f"第二层权重形状{W2.shape}") #(3, 2) 
print(f"第二层偏置形状{B2.shape}") # (2,)

A2 = np.dot(Z1, W2) + B2
Z2 = sigmoid(A2)
print(f"第二层激活值为{Z2}") # [0.62624937 0.7710107 ] (2,) 将作为输入信号传入第三层

#---------------第三层输出层--------------
# 最后的激活函数和之前的隐藏层有所不同。
def identity_function(x): #激活函数： 恒等函数
  return x

W3 = np.array([[0.1, 0.3], [0.2, 0.4]]) # 权重
B3 = np.array([0.1, 0.2]) # 偏置

A3 = np.dot(Z2, W3) + B3
Y = identity_function(A3)
print(f"输出层：{Z2}") # [0.62624937 0.7710107 ] 

#输出层所用的激活函数，要根据求解问题的性质决定
# 回归问题可以使用恒等函数
# 二元分类问题可以使用sigmoid函数
#多元分类问题可以使用softmax函数

